app/User.php

    public function getRecommend()
    {
        return Recommend::whereUserId($this->id)->get();
---
select * from `recommends` where `user_id` = '58'