app/Http/Controllers/ApiController.php

select * from `posts` where `posts`.`deleted_at` is null order by `created_at` desc limit 10
select `categories`.*, `post_categories`.`post_id` as `pivot_post_id`, `post_categories`.`category_id` as `pivot_category_id` from `categories` inner join `post_categories` on `categories`.`id` = `post_categories`.`category_id` where `post_categories`.`post_id` in ('1', '2', '3', '4', '5', '6', '7', '8', '9', '10')
---
    public function searchPostsByCategories()
    {
        return Post::with('categories')->latest()->take(10)->get();

select * from `books` where `books`.`deleted_at` is null order by `created_at` desc
select `categories`.*, `book_categories`.`book_id` as `pivot_book_id`, `book_categories`.`category_id` as `pivot_category_id` from `categories` inner join `book_categories` on `categories`.`id` = `book_categories`.`category_id` where `book_categories`.`book_id` in ('1', '2', '3', '4', '5', '6', '7', '8', '9', '10')
---
    public function searchBooksByCategories()
    {
        return Book::with('categories')->latest()->get();

select `categories`.*, `book_categories`.`book_id` as `pivot_book_id`, `book_categories`.`category_id` as `pivot_category_id` from `categories` inner join `book_categories` on `categories`.`id` = `book_categories`.`category_id` where `book_categories`.`book_id` in ('8')
---
    public function bookIndex(Book $book)
    {
        return Book::with(['categories', 'recommends'])->findOrFail($book->id);

select `categories`.*, `job_categories`.`job_id` as `pivot_job_id`, `job_categories`.`category_id` as `pivot_category_id` from `categories` inner join `job_categories` on `categories`.`id` = `job_categories`.`category_id` where `job_categories`.`job_id` in ('1', '2', '3', '4', '5', '6', '7', '8', '9', '10')
---
    public function searchJobsByCategories()
    {
        return Job::with('categories')->latest()->get();

select `categories`.*, `job_categories`.`job_id` as `pivot_job_id`, `job_categories`.`category_id` as `pivot_category_id` from `categories` inner join `job_categories` on `categories`.`id` = `job_categories`.`category_id` where `job_categories`.`job_id` in ('5')
---
    public function jobIndex(Job $job)
    {
        return Job::with(['categories', 'recommends'])->findOrFail($job->id);

select `categories`.*, `video_categories`.`video_id` as `pivot_video_id`, `video_categories`.`category_id` as `pivot_category_id` from `categories` inner join `video_categories` on `categories`.`id` = `video_categories`.`category_id` where `video_categories`.`video_id` in ('1')
---
    public function videoIndex(Video $video)
    {
        return Video::with(['categories', 'recommends'])

select * from `categories`
---
    public function categories()
    {
        return Category::all();