app/Http/Controllers/BookController.php

    public function edit(Book $book)
    {
        $existBookCategoryId = [];
        foreach ($book->categories as $category) {
            $existBookCategoryId[$category->id] = $category->name;
        }
        $categories = Category::pluck('name', 'id');
---
select `name`, `id` from `categories`