app/Http/Controllers/BookCategoryController.php

    public function show(Category $category)
    {
        return $category->books->load('categories');
---
select `books`.*, `book_categories`.`category_id` as `pivot_category_id`, `book_categories`.`book_id` as `pivot_book_id` from `books` inner join `book_categories` on `books`.`id` = `book_categories`.`book_id` where `book_categories`.`category_id` = '3' and `books`.`deleted_at` is null
select `categories`.*, `book_categories`.`book_id` as `pivot_book_id`, `book_categories`.`category_id` as `pivot_category_id` from `categories` inner join `book_categories` on `categories`.`id` = `book_categories`.`category_id` where `book_categories`.`book_id` in ('8')