app/Http/Controllers/PageController.php

select count(*) as aggregate from `books` where `books`.`deleted_at` is null
---
    public function book()
    {
        $books_count = Book::count();

select count(*) as aggregate from `posts` where `posts`.`deleted_at` is null
---
    public function post()
    {
        $posts_count = Post::count();

select count(*) as aggregate from `videos` where `videos`.`deleted_at` is null
---
    public function video()
    {
        $videos_count = Video::count();