app/Http/Controllers/RecommendController.php

    public function store(Request $request)
    {
        // dd($request);

        if (!$request->recommendable) {
            $recommend = Recommend::whereRecommendableId((int)$request->recommendable_id)
                                ->whereUserId($request->user_id)
                                ->whereRecommendableType($request->recommendable_type)->first();
            $recommend->delete();
        } else {
            Recommend::UpdateOrCreate([
            'recommendable_id' => (int)$request->recommendable_id,
            'user_id' => $request->user_id,
            'recommendable_type' => $request->recommendable_type,
            ]);
---
select * from `recommends` where `recommendable_id` = '5' and `user_id` = '2' and `recommendable_type` = 'ElectricalBlog\Job' limit 1
delete from `recommends` where `id` = '9'
select * from `recommends` where (`recommendable_id` = '5' and `user_id` = '2' and `recommendable_type` = 'ElectricalBlog\Job') limit 1