app/Http/Controllers/SearchController.php

    public function searchPost(Request $request, PostFilters $postfilters)
    {
        $post = Post::with('categories')->filter($postfilters)->get();
---
select `categories`.*, `post_categories`.`post_id` as `pivot_post_id`, `post_categories`.`category_id` as `pivot_category_id` from `categories` inner join `post_categories` on `categories`.`id` = `post_categories`.`category_id` where `post_categories`.`post_id` in ('2')

    public function searchVideo(Request $request, VideoFilters $videofilters)
    {
        $video = Video::with('categories')->filter($videofilters)->get();
---
select `categories`.*, `video_categories`.`video_id` as `pivot_video_id`, `video_categories`.`category_id` as `pivot_category_id` from `categories` inner join `video_categories` on `categories`.`id` = `video_categories`.`category_id` where `video_categories`.`video_id` in ('1')

    public function searchBook(Request $request, BookFilters $bookfilters)
    {
        $book = Book::with('categories')->filter($bookfilters)->get();
---
select `categories`.*, `book_categories`.`book_id` as `pivot_book_id`, `book_categories`.`category_id` as `pivot_category_id` from `categories` inner join `book_categories` on `categories`.`id` = `book_categories`.`category_id` where `book_categories`.`book_id` in ('1', '9')