app/Http/Controllers/VideoCategoryController.php

select `categories`.*, `video_categories`.`video_id` as `pivot_video_id`, `video_categories`.`category_id` as `pivot_category_id` from `categories` inner join `video_categories` on `categories`.`id` = `video_categories`.`category_id` where `video_categories`.`video_id` in ('1')
select `videos`.*, `video_categories`.`category_id` as `pivot_category_id`, `video_categories`.`video_id` as `pivot_video_id` from `videos` inner join `video_categories` on `videos`.`id` = `video_categories`.`video_id` where `video_categories`.`category_id` = '1' and `videos`.`deleted_at` is null
---
    public function show(Category $category)
    {
        return $category->videos->load('categories');